TwoPhaseFlow-master/run/benchmark/surfaceTension/curvatureWall/curvatureWall/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch curvature.foam
runApplication blockMesh
restore0Dir 

runApplication $(getApplication)


#------------------------------------------------------------------------------
