TwoPhaseFlow-master/run/benchmark/surfaceTension/curvatureWall/curvatureWall/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reconstructInterface;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          writeNow;

endTime         3.689e-4;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   5e-5;

//writeControl    timeStep;

//writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;
maxAlphaCo      0.1;

maxDeltaT       1e-7;

libs
(
    "libtwoPhaseProperties.so"
);
functions
{

    reconSurfaces
    {
        type            surfaces;
        libs            ("libpostProcess.so");
        writeControl    writeTime;

        surfaceFormat   vtk;
        fields          (alpha1);

        interpolationScheme cell;

        surfaces
        (

            freeSurf
            {
                type            interface;
                interpolate     false;
            }

        );
    }

}


// ************************************************************************* //
